       IDENTIFICATION DIVISION.
       PROGRAM-id. BasicMath.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 99 VALUE 12.
       01 NUM2 PIC 9v99 VALUE 4.00.
       01 Ans PIC 99v9.
       01 Rem PIC 999.
       PROCEDURE DIVISION.
       DISPLAY "ADD NUM1 TO NUM2: ". 
       ACCEPT NUM1.
       ACCEPT NUM2.
       ADD NUM1 TO NUM2 GIVING Ans.
       DISPLAY "ADD NUM1 TO NUM2: " Ans. 

       SUBTRACT NUM1 FROM NUM2 GIVING Ans
       DISPLAY "SUBTRACT NUM1 FROM NUM2: " Ans.
       MULTIPLY NUM1 BY NUM2 GIVING Ans.
       DISPLAY "MULTIPLY NUM1 FROM NUM2: " Ans.
       DIVIDE NUM1 INTO NUM2 GIVING Ans 
       DISPLAY "DIVIDE NUM1 INTO NUM2: " Ans.
       DIVIDE NUM1 INTO NUM2 GIVING Ans REMAINDER Rem. 
       DISPLAY "DIVIDE NUM1 INTO NUM2 GIVING: " Ans.

           STOP RUN.

